memtier/performance/data/armorix/all-2.out
12        Threads
50        Connections per thread
50        Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        23079.33          ---          ---         2.42575         2.39900         3.31100         4.63900         6.75100      1574.86 
Gets       230733.41        12.00    230721.41         2.35686         2.35100         2.71900         3.35900         5.88700      5833.49 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     253812.74        12.00    230721.41         2.36313         2.35100         2.76700         3.51900         6.01500      7408.35 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.159        0.000
SET       2.255        5.000
SET       2.287       10.000
SET       2.303       15.000
SET       2.319       20.000
SET       2.335       25.000
SET       2.351       30.000
SET       2.367       35.000
SET       2.367       40.000
SET       2.383       45.000
SET       2.399       50.000
SET       2.399       52.500
SET       2.415       55.000
SET       2.415       57.500
SET       2.431       60.000
SET       2.431       62.500
SET       2.447       65.000
SET       2.447       67.500
SET       2.463       70.000
SET       2.463       72.500
SET       2.479       75.000
SET       2.479       76.250
SET       2.479       77.500
SET       2.495       78.750
SET       2.495       80.000
SET       2.495       81.250
SET       2.511       82.500
SET       2.511       83.750
SET       2.511       85.000
SET       2.527       86.250
SET       2.527       87.500
SET       2.543       88.125
SET       2.543       88.750
SET       2.543       89.375
SET       2.559       90.000
SET       2.559       90.625
SET       2.559       91.250
SET       2.575       91.875
SET       2.575       92.500
SET       2.591       93.125
SET       2.591       93.750
SET       2.591       94.062
SET       2.607       94.375
SET       2.607       94.688
SET       2.607       95.000
SET       2.623       95.312
SET       2.623       95.625
SET       2.639       95.938
SET       2.639       96.250
SET       2.655       96.562
SET       2.671       96.875
SET       2.671       97.031
SET       2.687       97.188
SET       2.687       97.344
SET       2.703       97.500
SET       2.719       97.656
SET       2.735       97.812
SET       2.751       97.969
SET       2.783       98.125
SET       2.815       98.281
SET       2.863       98.438
SET       2.895       98.516
SET       2.927       98.594
SET       2.975       98.672
SET       3.039       98.750
SET       3.103       98.828
SET       3.183       98.906
SET       3.295       98.984
SET       3.423       99.062
SET       3.567       99.141
SET       3.743       99.219
SET       3.855       99.258
SET       3.983       99.297
SET       4.095       99.336
SET       4.255       99.375
SET       4.383       99.414
SET       4.511       99.453
SET       4.607       99.492
SET       4.703       99.531
SET       4.831       99.570
SET       4.959       99.609
SET       5.023       99.629
SET       5.087       99.648
SET       5.183       99.668
SET       5.279       99.688
SET       5.343       99.707
SET       5.439       99.727
SET       5.535       99.746
SET       5.663       99.766
SET       5.791       99.785
SET       5.919       99.805
SET       6.015       99.814
SET       6.111       99.824
SET       6.175       99.834
SET       6.271       99.844
SET       6.335       99.854
SET       6.463       99.863
SET       6.527       99.873
SET       6.623       99.883
SET       6.687       99.893
SET       6.783       99.902
SET       6.815       99.907
SET       6.847       99.912
SET       6.911       99.917
SET       6.943       99.922
SET       7.007       99.927
SET       7.071       99.932
SET       7.135       99.937
SET       7.263       99.941
SET       7.391       99.946
SET       7.615       99.951
SET       7.679       99.954
SET       7.807       99.956
SET       7.903       99.958
SET       7.999       99.961
SET       8.095       99.963
SET       8.255       99.966
SET       8.383       99.968
SET       8.575       99.971
SET       8.767       99.973
SET       8.895       99.976
SET       9.023       99.977
SET       9.087       99.978
SET       9.215       99.979
SET       9.343       99.980
SET       9.471       99.982
SET       9.663       99.983
SET       9.855       99.984
SET       9.983       99.985
SET      10.239       99.987
SET      10.559       99.988
SET      10.623       99.988
SET      10.815       99.989
SET      11.007       99.990
SET      11.135       99.990
SET      11.263       99.991
SET      11.455       99.991
SET      11.583       99.992
SET      11.711       99.993
SET      11.967       99.993
SET      12.095       99.994
SET      12.159       99.994
SET      12.223       99.995
SET      12.351       99.995
SET      12.415       99.995
SET      12.479       99.995
SET      12.543       99.996
SET      12.607       99.996
SET      12.735       99.996
SET      12.735       99.997
SET      12.863       99.997
SET      12.863       99.997
SET      12.927       99.997
SET      12.927       99.997
SET      12.991       99.998
SET      12.991       99.998
SET      13.055       99.998
SET      13.055       99.998
SET      13.055       99.998
SET      13.183       99.998
SET      13.183       99.998
SET      13.247       99.999
SET      13.247       99.999
SET      13.247       99.999
[...]
SET      13.311       99.999
SET      13.311       99.999
SET      13.375       99.999
SET      13.375       99.999
SET      13.439       99.999
SET      13.439       99.999
SET      13.503       99.999
SET      13.503       99.999
SET      13.503       99.999
SET      13.567       99.999
SET      13.567       99.999
SET      13.631      100.000
SET      13.631      100.000
SET      13.695      100.000
SET      13.695      100.000
SET      13.695      100.000
SET      13.759      100.000
SET      13.759      100.000
SET      13.759      100.000
[...]
SET      13.823      100.000
SET      13.823      100.000
SET      13.823      100.000
[...]
SET      13.887      100.000
SET      13.887      100.000
SET      13.887      100.000
[...]
SET      13.951      100.000
SET      13.951      100.000
---
GET       0.047        0.000
GET       2.191        5.000
GET       2.223       10.000
GET       2.239       15.000
GET       2.271       20.000
GET       2.287       25.000
GET       2.303       30.000
GET       2.303       35.000
GET       2.319       40.000
GET       2.335       45.000
GET       2.351       50.000
GET       2.351       52.500
GET       2.351       55.000
GET       2.367       57.500
GET       2.367       60.000
GET       2.383       62.500
GET       2.383       65.000
GET       2.399       67.500
GET       2.399       70.000
GET       2.415       72.500
GET       2.415       75.000
GET       2.431       76.250
GET       2.431       77.500
GET       2.431       78.750
GET       2.431       80.000
GET       2.447       81.250
GET       2.447       82.500
GET       2.447       83.750
GET       2.463       85.000
GET       2.463       86.250
GET       2.479       87.500
GET       2.479       88.125
GET       2.479       88.750
GET       2.495       89.375
GET       2.495       90.000
GET       2.495       90.625
GET       2.495       91.250
GET       2.511       91.875
GET       2.511       92.500
GET       2.527       93.125
GET       2.527       93.750
GET       2.527       94.062
GET       2.527       94.375
GET       2.543       94.688
GET       2.543       95.000
GET       2.543       95.312
GET       2.559       95.625
GET       2.559       95.938
GET       2.559       96.250
GET       2.575       96.562
GET       2.575       96.875
GET       2.575       97.031
GET       2.591       97.188
GET       2.591       97.344
GET       2.591       97.500
GET       2.607       97.656
GET       2.607       97.812
GET       2.623       97.969
GET       2.623       98.125
GET       2.639       98.281
GET       2.639       98.438
GET       2.655       98.516
GET       2.655       98.594
GET       2.671       98.672
GET       2.671       98.750
GET       2.687       98.828
GET       2.703       98.906
GET       2.719       98.984
GET       2.751       99.062
GET       2.783       99.141
GET       2.831       99.219
GET       2.863       99.258
GET       2.895       99.297
GET       2.959       99.336
GET       3.023       99.375
GET       3.119       99.414
GET       3.215       99.453
GET       3.327       99.492
GET       3.487       99.531
GET       3.663       99.570
GET       3.903       99.609
GET       4.031       99.629
GET       4.159       99.648
GET       4.287       99.668
GET       4.415       99.688
GET       4.511       99.707
GET       4.607       99.727
GET       4.671       99.746
GET       4.767       99.766
GET       4.863       99.785
GET       5.023       99.805
GET       5.087       99.814
GET       5.183       99.824
GET       5.247       99.834
GET       5.343       99.844
GET       5.439       99.854
GET       5.503       99.863
GET       5.599       99.873
GET       5.695       99.883
GET       5.823       99.893
GET       5.919       99.902
GET       5.983       99.907
GET       6.047       99.912
GET       6.111       99.917
GET       6.175       99.922
GET       6.239       99.927
GET       6.303       99.932
GET       6.367       99.937
GET       6.431       99.941
GET       6.495       99.946
GET       6.527       99.951
GET       6.559       99.954
GET       6.591       99.956
GET       6.623       99.958
GET       6.655       99.961
GET       6.687       99.963
GET       6.719       99.966
GET       6.751       99.968
GET       6.783       99.971
GET       6.815       99.973
GET       6.847       99.976
GET       6.847       99.977
GET       6.879       99.978
GET       6.879       99.979
GET       6.911       99.980
GET       6.911       99.982
GET       6.943       99.983
GET       6.975       99.984
GET       7.007       99.985
GET       7.039       99.987
GET       7.071       99.988
GET       7.103       99.988
GET       7.135       99.989
GET       7.167       99.990
GET       7.231       99.990
GET       7.263       99.991
GET       7.359       99.991
GET       7.487       99.992
GET       7.583       99.993
GET       7.711       99.993
GET       7.775       99.994
GET       7.871       99.994
GET       7.935       99.995
GET       7.967       99.995
GET       8.031       99.995
GET       8.095       99.995
GET       8.191       99.996
GET       8.255       99.996
GET       8.383       99.996
GET       8.511       99.997
GET       8.639       99.997
GET       8.703       99.997
GET       8.767       99.997
GET       8.831       99.997
GET       8.895       99.998
GET       8.959       99.998
GET       9.023       99.998
GET       9.023       99.998
GET       9.087       99.998
GET       9.151       99.998
GET       9.215       99.998
GET       9.215       99.999
GET       9.215       99.999
GET       9.279       99.999
GET       9.279       99.999
GET       9.279       99.999
GET       9.343       99.999
GET       9.407       99.999
GET       9.471       99.999
GET       9.535       99.999
GET       9.599       99.999
GET       9.599       99.999
GET       9.663       99.999
GET       9.663       99.999
GET       9.727       99.999
GET       9.791       99.999
GET       9.855       99.999
GET       9.855      100.000
GET       9.919      100.000
GET       9.919      100.000
GET       9.919      100.000
GET       9.983      100.000
GET      10.047      100.000
GET      10.047      100.000
GET      10.047      100.000
GET      10.111      100.000
GET      10.111      100.000
GET      10.111      100.000
GET      10.175      100.000
GET      10.239      100.000
GET      10.367      100.000
GET      10.623      100.000
GET      10.623      100.000
GET      10.687      100.000
GET      10.687      100.000
GET      10.687      100.000
GET      10.751      100.000
GET      10.751      100.000
GET      10.751      100.000
[...]
GET      10.879      100.000
GET      10.879      100.000
GET      11.071      100.000
GET      11.071      100.000
GET      11.199      100.000
GET      11.199      100.000
GET      11.455      100.000
GET      11.455      100.000
GET      11.647      100.000
GET      11.647      100.000
GET      12.095      100.000
GET      12.095      100.000
---
WAIT      0.000      100.000